Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Initializing modules...
Downloading registry.terraform.io/Jellayy/ec2-apache/aws 1.0.2 for ec2_apache...
- ec2_apache in .terraform/modules/ec2_apache

Initializing Terraform Cloud...

Initializing provider plugins...
- Finding hashicorp/aws versions matching ">= 4.6.0"...
- Finding latest version of hashicorp/template...
- Installing hashicorp/aws v4.17.1...
- Installed hashicorp/aws v4.17.1 (signed by HashiCorp)
- Installing hashicorp/template v2.2.0...
- Installed hashicorp/template v2.2.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform Cloud has been successfully initialized!

You may now begin working with Terraform Cloud. Try running "terraform plan" to
see any changes that are required for your infrastructure.

If you ever set or change modules or Terraform Settings, run "terraform init"
again to reinitialize your working directory.

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/jellayy/atlantis-testing/runs/run-GqonH1p9gWCujzL3

Waiting for the plan to start...

Terraform v1.2.2
on linux_amd64
Initializing plugins and modules...
module.ec2_apache.data.template_file.httpd_configure: Reading...
module.ec2_apache.data.template_file.httpd_configure: Read complete after 0s [id=708ff514b0fc9e595f76c1f18d5e76cee411a80b4f6b9b7f648971c142dd0b89]
module.ec2_apache.data.aws_vpc.default_vpc: Reading...
module.ec2_apache.data.aws_ami.ec2_ami: Reading...
module.ec2_apache.data.aws_vpc.default_vpc: Read complete after 0s [id=vpc-0ddbf613025edff8a]
module.ec2_apache.data.aws_ami.ec2_ami: Read complete after 1s [id=ami-088cd0732583ac947]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ec2_apache.aws_instance.ec2_server will be created
  + resource "aws_instance" "ec2_server" {
      + ami                                  = "ami-088cd0732583ac947"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "Very Great Web Server Deployer Key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "Very Great Web Server"
        }
      + tags_all                             = {
          + "Name" = "Very Great Web Server"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "107b64a191b283be7f8304bcbeb1a107d2560a17"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # module.ec2_apache.aws_key_pair.ssh_deployer_key will be created
  + resource "aws_key_pair" "ssh_deployer_key" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "Very Great Web Server Deployer Key"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC6+9Tj14EGNEdpu43ZET0z1g7RxgEryQqlCYgO9SxKfT/jRssp3sr2kQML7UWoakmxtX3L8z4h7y9wvzXiMYX+W95M+cq5FtnrMmRFxyDekM6nhfkJjgYGnJ1HRH+DBpAaG3igqQmtUGLxtSzkpp6VNwJz1o1ZuJW+qFqxbH7/r/CncWno+ZkvQQQIMlM9YaZ96nERimX2JhW5ueEoe8jI53hVn9r1eGcuCUxf5paQBNLrzZ5j1uAKHgVc/8CjT/ONeydfAGC9q1ZcMCFkBI2FxGi8NXU6PfFikvKPZ710QE/d+80bqMSiQgAEFG007eEFBNRHhfsJsJq0ny0VNTRdt4H1C6v/YsrAQegqIhXBOFGHh8Iovz2KJtatTMJizCGcsxTMZiwrqdPF1hSNhiCnZg7eg27PdHj6a3Fo9IbDuxRHJ4Kjq6LW6zVoK2M6DUaI/GvI1dEdrQ9XncQvxIucamkITMG/4FyhmKFkiJQ2M4ItHpfyNK/7Ww+rEEPY1Dc= jellayy@mbp.jellayy.com"
      + tags_all        = (known after apply)
    }

  # module.ec2_apache.aws_security_group.ec2_sg will be created
  + resource "aws_security_group" "ec2_sg" {
      + arn                    = (known after apply)
      + description            = "Very Great Web Server Security Group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "72.201.119.0/24",
                ]
              + description      = "SSH"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "sg Very Great Web Server"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0ddbf613025edff8a"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + web_server_ip = (known after apply)

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://0787886387e4:4141/lock?id=Jellayy%252Fatlantis-testing%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 3 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
